Catalogs/Renault_СкриптыРезультатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_СкриптыРезультатов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДиллерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыСобытийАвтоСервиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСценария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/Renault_ОстаткиБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_ОстаткиБаллов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КартаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПогаситьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Renault_СкриптыРезультатов/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ТипОперации) Тогда
		Сообщить ("Необходимо указать тип операции.");
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДиллерскийЦентр) Тогда
		
		Сообщить ("Необходимо указать диллерский центр.");
		
		Отказ = Истина;
		
	Иначе
		
		СправочникиТекЦентра = Справочники.Renault_СкриптыРезультатов.НайтиПоРеквизиту("ДиллерскийЦентр", ЭтотОбъект.ДиллерскийЦентр);
		
		//Если СправочникиТекЦентра.ТипОперации = ЭтотОбъект.ТипОперации И СправочникиТекЦентра <> ЭтотОбъект Тогда
		//	
		//	Сообщить("Для данного типа операции и диллерского центра уже есть скрипт " + СправочникиТекЦентра + ".");
		//	Отказ = Истина;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьИтоговыйТекст(ТаблицаОбъектов) Экспорт
	
	МассивЭлементов = ПолучитьМассивПараметров();
	ТаблицаВсего = РасшифроватьПараметры(МассивЭлементов, ТаблицаОбъектов);
	
	Текст = ЭтотОбъект.ТекстСценария;
	
	Для Каждого Ст из ТаблицаВсего Цикл
		
		Если ЗначениеЗаполнено(Ст.РасшифровкаПараметра) Тогда
			
			Текст = СтрЗаменить(Текст, "[" + Ст.Параметр + "]", Ст.РасшифровкаПараметра);
			
		Иначе
			
			Текст = СтрЗаменить(Текст, "[" + Ст.Параметр + "]", " __ ");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Текст;
	
	
КонецФункции

Функция ПолучитьМассивПараметров() Экспорт
	
	Текст = ЭтотОбъект.ТекстСценария;
	
	Если ЗначениеЗаполнено(Текст) Тогда
	
	Скобка = Найти(Текст, "[");
	МассивПараметров = Новый Массив(); 
	
		Если Скобка > 0 Тогда
		
		Стр = обРазложитьСтрокуВМассивПодстрок(Текст,"[");
		ЭтоПрев = Истина;
			Для Каждого Строк из Стр Цикл
				Если ЭтоПрев Тогда
					ЭтоПрев = Ложь;
					Продолжить;
				КонецЕсли;
				
				Стр2 = обРазложитьСтрокуВМассивПодстрок(Строк, "]");
				МассивПараметров.Добавить(Стр2[0]);
				
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивПараметров;
	
КонецФункции

Функция РасшифроватьПараметры(МассивПараметров, ТаблицаОбъектов)
	
	ТЗ = Новый ТаблицаЗначений();
//	ТЗ.Колонки.Добавить("Параметр", Новый ОписаниеТипов("Строка"));
//	ТЗ.Колонки.Добавить("ИмяПараметра", Новый ОписаниеТипов("Строка"));
//	ТЗ.Колонки.Добавить("РасшифровкаПараметра", Новый ОписаниеТипов("Строка"));
	
	ТЗ.Колонки.Добавить("Параметр");
	ТЗ.Колонки.Добавить("ИмяПараметра");
	ТЗ.Колонки.Добавить("РасшифровкаПараметра");
	
	ТаблицаОбъекты = ТаблицаОбъектов;
	
	Для Каждого Параметр из МассивПараметров Цикл
		
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Параметр = Параметр;
		
		Пар = обРазложитьСтрокуВМассивПодстрок(Параметр, ".");
		
		Если Пар[0] = "Спр" Тогда
			
			Пар[0] = "Справочник";
			
		ИначеЕсли Пар[0] = "Док" Тогда
			
			Пар[0] = "Документ";
			
		ИначеЕсли Пар[0] = "Рег" Тогда
			
			Пар[0] = "РегистрСведений";
			
		КонецЕсли;
		
		НоваяСтрока.ИмяПараметра = Пар[0]+ "." + Пар[1] + "." + Пар[2];
		
		СтрокаОбъекта = ТаблицаОбъекты.Найти(Пар[0] + "." + Пар[1], "СсылкаСтрока");
		
		Если СтрокаОбъекта <> Неопределено Тогда 
		
			Если ЗначениеЗаполнено(СтрокаОбъекта.ЭлементДляПроверки) Тогда
				
				Объект = СтрокаОбъекта.ЭлементДляПроверки.Ссылка;
				
				Если Пар[2] = "ОстатокБаллов" Тогда
					РасшифрокаПараметра = ПолучитьОстатокБаллов(Объект);
				Иначе
					РасшифрокаПараметра = Объект[Пар[2]];
				КонецЕсли;
				
				НоваяСтрока.РасшифровкаПараметра = РасшифрокаПараметра;
				
			Иначе
				
				НоваяСтрока.РасшифровкаПараметра = Параметр;
				
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока.РасшифровкаПараметра = " __ ";
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции

Функция ПолучитьОстатокБаллов(КартаЛояльности)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Renault_ОстаткиБалловОстатки.КоличествоБалловОстаток КАК Остаток_Баллов
	|ИЗ
	|	РегистрНакопления.Renault_ОстаткиБаллов.Остатки(
	|			&ТекущаяДата,
	|			КартаЛояльности = &КартаЛояльности
	|				И (ПогаситьДо >= &ТекущаяДата
	|					ИЛИ ПогаситьДо = &ПустаяДата)) КАК Renault_ОстаткиБалловОстатки";
	
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101")); 
	Запрос.УстановитьПараметр("КартаЛояльности", КартаЛояльности);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Остаток_Баллов;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
